Repository: Prime-Holding/flutter-module-based-architecture
Catalog: shared/lib/src/l10n/arb/feature_widget_toolkit/*.arb
Languages: bg

# navWidgetToolkit
source: Widgets
bg: Компоненти

source: Common Components
bg: Общи компоненти

source: Pickers
bg: Kомпоненти с избиране

source: Edit Fields
bg: Полета за редактиране

source: OpenUrlWidget - launch URL link
bg: Компонент за избор на URL връзка

source: OpenUrlWidget - call a phone number
bg: Компонент за обаждане на телефонен номер

source: Shimmer Wrapper
bg: Обвивка с анимация

source: Text Shimmer
bg: Текстовa анимация

source: Displays Text after loaded
bg: Показва текст след зареждане

source: Modal Sheet with message
bg: Модалена страница със съобщение

source: Open modal sheet
bg: Отворете модална страница

source: This is an informative message
bg: Това е информативно съобщение

source: Error Modal Sheet
bg: Модалена страница с грешки

source: Present error in modal
bg: Настояща грешка в модална страница

source: This is an error message
bg: Това е съобщение за грешка

source: Buttons
bg: Бутони

source: OutlineFillButton
bg: Очертан и запълнен бутон

source: GradientFillButton
bg: Бутон с градиентно запълване

source: GradientFillButton - disabled
bg: Бутон с градиентно запълване - деактивиран

source: IconTextButton
bg: Текстов бутон с икона

source: Retry
bg: Опитай отново

source: ItemPicker - single select
bg: Избор на един елемент

source: Select one item
bg: Изберете един елемент

source: Select a single item
bg: Изберете един елемент

source: ItemPicker - multi select
bg: Избор на няколко елемента

source: Select a few items
bg: Изберете няколко елемента

source: Search Picker
bg: Компонент за търсене

# selectAnItemFromLongList
source: Select an item from a long list
bg: Изберете елемент от дълъг списък

source: Select country
bg: Изберете държава

source: Type substring
bg: Въведете подниз

# thereAreNoResults
source: There are no results for the searched query!
bg: Няма резултати за търсената заявка!

source: Selected Items:
bg: Избрани елементи:

source: Selected Item:
bg: Избран елемент:

source: TextFieldDialog
bg: Диалог в текстово поле

# textFieldLabel
source: First Name
bg: Първо име

# nameValue
source: John
bg: Джон

# headerValue
source: Enter your data
bg: Въведети информацията

source: EditAddress
bg: Промени адрес

# textFieldButtonText
source: Save
bg: Запази

# editAddressCountrySearchPickerTitle
source: Choose country
bg: Избери държава

# editAddressCountrySearchPickerHintText
source: Search by country name
bg: Търси по име на държава

# editAddressCountrySearchPickerRetryText
source: Retry
bg: Опитай отново

# editAddressCountryLabelText
source: Country
bg: Държава

# editAddressCityButtonText
source: Save
bg: Запази

# editAddressCityLabelText
source: City
bg: Град

# editAddressCityEmptyLabel
source: Add city
bg: Добави град

# editAddressAddressButtonText
source: Save
bg: Запази

# editAddressAddressLabelText
source: Address
bg: Адрес

# editAddressAddressEmptyLabel
source: Add address
bg: Добави адрес

# editAddressAddressChangedMessage
source: You've successfully changed your address data
bg: Успешно променихте вашия адрес.

# editAddressCardFieldLabel
source: Contact Address
bg: Адрес за контакт

# editAddressSaveButtonText
source: Save
bg: Запази

# editAddressHeaderTitle
source: Contact Address
bg: Адрес за контакт

# editAddressPermanentAddressContentMessage
source: This is your permanent address content message. To change the address, you must set Show read only address to false.
bg: Това е вашият постоянен адрес. За да промените адреса, трябва да промените Show read only address на false.
